```
=========> Existing resources:
[command]/usr/local/vss-agent/2.309.0/_work/_temp/0e1ea3bf-67f9-4a70-92f8-07cee22414e0/terraform-bin state list
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.container_apps.azurerm_application_insights.this
module.docker_image.docker_image.proxy
module.docker_image.docker_registry_image.proxy
module.docker_image.null_resource.go_code_keeper
module.endpoint_blob.azurerm_storage_account.endpoint
module.endpoint_blob.azurerm_storage_blob.endpoint
module.endpoint_blob.azurerm_storage_container.endpoint
module.resource_group.azurerm_resource_group.this
module.acr.module.public_ip.data.curl.big_data_cloud
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]
::debug::Terraform exited with code 0.
::debug::stdout: module.acr.data.azurerm_container_registry_scope_map.pull%0Amodule.acr.data.azurerm_container_registry_scope_map.push%0Amodule.acr.azurerm_container_registry.this%0Amodule.acr.azurerm_container_registry_token.pull%0Amodule.acr.azurerm_container_registry_token.push%0Amodule.acr.azurerm_container_registry_token_password.pull_password%0Amodule.acr.azurerm_container_registry_token_password.push_password%0Amodule.acr.azurerm_private_dns_a_record.data%0Amodule.acr.azurerm_private_dns_a_record.login_server%0Amodule.acr.azurerm_private_dns_zone.pdz%0Amodule.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private%0Amodule.acr.azurerm_private_endpoint.pep%0Amodule.acr.azurerm_subnet.acr%0Amodule.acr.azurerm_subnet.container_apps%0Amodule.acr.azurerm_virtual_network.vnet%0Amodule.container_apps.azurerm_application_insights.this%0Amodule.docker_image.docker_image.proxy%0Amodule.docker_image.docker_registry_image.proxy%0Amodule.docker_image.null_resource.go_code_keeper%0Amodule.endpoint_blob.azurerm_storage_account.endpoint%0Amodule.endpoint_blob.azurerm_storage_blob.endpoint%0Amodule.endpoint_blob.azurerm_storage_container.endpoint%0Amodule.resource_group.azurerm_resource_group.this%0Amodule.acr.module.public_ip.data.curl.big_data_cloud%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env%0Amodule.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]%0A
::debug::stderr: 
::debug::exitcode: 0
[command]/usr/local/vss-agent/2.309.0/_work/_temp/0e1ea3bf-67f9-4a70-92f8-07cee22414e0/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.proxy has been deleted
  - resource "docker_image" "proxy" {
        id       = "sha256:fa7579f41ed6458e5bef18b293f4f81f63791816dc4fc225bf579ced4c2dbd8bavmtelemetry.azurecr.io/telemetry_proxy"
      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.docker_image.docker_registry_image.proxy has been deleted
  - resource "docker_registry_image" "proxy" {
        id                   = "sha256:007b780c51f106eb157264b7115e4a26222778032c0723a3e1b4a6bf8450a3c9"
      - name                 = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "pull" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_pull"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_container_registry_scope_map" "push" {
      + actions                 = (known after apply)
      + container_registry_name = "avmtelemetry"
      + description             = (known after apply)
      + id                      = (known after apply)
      + name                    = "_repositories_push"
      + resource_group_name     = "avm-telemetry"
    }

  # module.acr.azurerm_container_registry.this will be updated in-place
  ~ resource "azurerm_container_registry" "this" {
        id                            = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry"
        name                          = "avmtelemetry"
      ~ network_rule_set              = [
          ~ {
              ~ ip_rule         = (sensitive value)
                # (2 unchanged attributes hidden)
            },
        ]
        tags                          = {}
        # (15 unchanged attributes hidden)
    }

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash"  = "b49c3f11e0f8641261e42ae428a8a9ad"
          + "dockerfile" = "260b798ab8e87ead5afd25c4bfb11577"
        }

      + build {
          + cache_from   = []
          + context      = "docker_image"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
        }
    }

  # module.docker_image.docker_registry_image.proxy will be created
  + resource "docker_registry_image" "proxy" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "avmtelemetry.azurecr.io/telemetry_proxy"
      + sha256_digest        = (known after apply)
    }

  # module.docker_image.null_resource.go_code_keeper must be replaced
-/+ resource "null_resource" "go_code_keeper" {
      ~ id       = "6642159707818772006" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "code_hash"  = "44213dc42526af8cfd7acfb42d5dd031" -> "b49c3f11e0f8641261e42ae428a8a9ad"
            # (1 unchanged element hidden)
        }
    }

  # module.endpoint_blob.azurerm_storage_account.endpoint must be replaced
-/+ resource "azurerm_storage_account" "endpoint" {
      ~ access_tier                       = "Hot" -> (known after apply)
      ~ id                                = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Storage/storageAccounts/avmtftelemetrysvc" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
        name                              = "avmtftelemetrysvc"
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://avmtftelemetrysvc.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "avmtftelemetrysvc.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://avmtftelemetrysvc.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "avmtftelemetrysvc.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://avmtftelemetrysvc.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "avmtftelemetrysvc.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "eastus" -> (known after apply)
      ~ primary_queue_endpoint            = "https://avmtftelemetrysvc.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "avmtftelemetrysvc.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://avmtftelemetrysvc.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "avmtftelemetrysvc.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://avmtftelemetrysvc.z13.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "avmtftelemetrysvc.z13.web.core.windows.net" -> (known after apply)
      ~ resource_group_name               = "avm-telemetry" -> "eastus" # forces replacement
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      ~ secondary_location                = "westus" -> (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      - tags                              = {} -> null
        # (17 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

Plan: 4 to add, 1 to change, 2 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.docker_image.docker_image.proxy has been deleted%0A  - resource "docker_image" "proxy" {%0A        id       = "sha256:fa7579f41ed6458e5bef18b293f4f81f63791816dc4fc225bf579ced4c2dbd8bavmtelemetry.azurecr.io/telemetry_proxy"%0A      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null%0A        # (2 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.docker_image.docker_registry_image.proxy has been deleted%0A  - resource "docker_registry_image" "proxy" {%0A        id                   = "sha256:007b780c51f106eb157264b7115e4a26222778032c0723a3e1b4a6bf8450a3c9"%0A      - name                 = "avmtelemetry.azurecr.io/telemetry_proxy" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.pull will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "pull" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_pull"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.data.azurerm_container_registry_scope_map.push will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "azurerm_container_registry_scope_map" "push" {%0A      + actions                 = (known after apply)%0A      + container_registry_name = "avmtelemetry"%0A      + description             = (known after apply)%0A      + id                      = (known after apply)%0A      + name                    = "_repositories_push"%0A      + resource_group_name     = "avm-telemetry"%0A    }%0A%0A  # module.acr.azurerm_container_registry.this will be updated in-place%0A  ~ resource "azurerm_container_registry" "this" {%0A        id                            = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.ContainerRegistry/registries/avmtelemetry"%0A        name                          = "avmtelemetry"%0A      ~ network_rule_set              = [%0A          ~ {%0A              ~ ip_rule         = (sensitive value)%0A                # (2 unchanged attributes hidden)%0A            },%0A        ]%0A        tags                          = {}%0A        # (15 unchanged attributes hidden)%0A    }%0A%0A  # module.docker_image.docker_image.proxy will be created%0A  + resource "docker_image" "proxy" {%0A      + id          = (known after apply)%0A      + image_id    = (known after apply)%0A      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + repo_digest = (known after apply)%0A      + triggers    = {%0A          + "code_hash"  = "b49c3f11e0f8641261e42ae428a8a9ad"%0A          + "dockerfile" = "260b798ab8e87ead5afd25c4bfb11577"%0A        }%0A%0A      + build {%0A          + cache_from   = []%0A          + context      = "docker_image"%0A          + dockerfile   = "Dockerfile"%0A          + extra_hosts  = []%0A          + remove       = true%0A          + security_opt = []%0A          + tag          = [%0A              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",%0A            ]%0A        }%0A    }%0A%0A  # module.docker_image.docker_registry_image.proxy will be created%0A  + resource "docker_registry_image" "proxy" {%0A      + id                   = (known after apply)%0A      + insecure_skip_verify = false%0A      + keep_remotely        = true%0A      + name                 = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + sha256_digest        = (known after apply)%0A    }%0A%0A  # module.docker_image.null_resource.go_code_keeper must be replaced%0A-/+ resource "null_resource" "go_code_keeper" {%0A      ~ id       = "6642159707818772006" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "code_hash"  = "44213dc42526af8cfd7acfb42d5dd031" -> "b49c3f11e0f8641261e42ae428a8a9ad"%0A            # (1 unchanged element hidden)%0A        }%0A    }%0A%0A  # module.endpoint_blob.azurerm_storage_account.endpoint must be replaced%0A-/+ resource "azurerm_storage_account" "endpoint" {%0A      ~ access_tier                       = "Hot" -> (known after apply)%0A      ~ id                                = "/subscriptions/f7a632a5-49db-4c5e-9828-cd62cb753971/resourceGroups/avm-telemetry/providers/Microsoft.Storage/storageAccounts/avmtftelemetrysvc" -> (known after apply)%0A      + large_file_share_enabled          = (known after apply)%0A        name                              = "avmtftelemetrysvc"%0A      ~ primary_access_key                = (sensitive value)%0A      ~ primary_blob_connection_string    = (sensitive value)%0A      ~ primary_blob_endpoint             = "https://avmtftelemetrysvc.blob.core.windows.net/" -> (known after apply)%0A      ~ primary_blob_host                 = "avmtftelemetrysvc.blob.core.windows.net" -> (known after apply)%0A      ~ primary_connection_string         = (sensitive value)%0A      ~ primary_dfs_endpoint              = "https://avmtftelemetrysvc.dfs.core.windows.net/" -> (known after apply)%0A      ~ primary_dfs_host                  = "avmtftelemetrysvc.dfs.core.windows.net" -> (known after apply)%0A      ~ primary_file_endpoint             = "https://avmtftelemetrysvc.file.core.windows.net/" -> (known after apply)%0A      ~ primary_file_host                 = "avmtftelemetrysvc.file.core.windows.net" -> (known after apply)%0A      ~ primary_location                  = "eastus" -> (known after apply)%0A      ~ primary_queue_endpoint            = "https://avmtftelemetrysvc.queue.core.windows.net/" -> (known after apply)%0A      ~ primary_queue_host                = "avmtftelemetrysvc.queue.core.windows.net" -> (known after apply)%0A      ~ primary_table_endpoint            = "https://avmtftelemetrysvc.table.core.windows.net/" -> (known after apply)%0A      ~ primary_table_host                = "avmtftelemetrysvc.table.core.windows.net" -> (known after apply)%0A      ~ primary_web_endpoint              = "https://avmtftelemetrysvc.z13.web.core.windows.net/" -> (known after apply)%0A      ~ primary_web_host                  = "avmtftelemetrysvc.z13.web.core.windows.net" -> (known after apply)%0A      ~ resource_group_name               = "avm-telemetry" -> "eastus" # forces replacement%0A      ~ secondary_access_key              = (sensitive value)%0A      + secondary_blob_connection_string  = (sensitive value)%0A      + secondary_blob_endpoint           = (known after apply)%0A      + secondary_blob_host               = (known after apply)%0A      ~ secondary_connection_string       = (sensitive value)%0A      + secondary_dfs_endpoint            = (known after apply)%0A      + secondary_dfs_host                = (known after apply)%0A      + secondary_file_endpoint           = (known after apply)%0A      + secondary_file_host               = (known after apply)%0A      ~ secondary_location                = "westus" -> (known after apply)%0A      + secondary_queue_endpoint          = (known after apply)%0A      + secondary_queue_host              = (known after apply)%0A      + secondary_table_endpoint          = (known after apply)%0A      + secondary_table_host              = (known after apply)%0A      + secondary_web_endpoint            = (known after apply)%0A      + secondary_web_host                = (known after apply)%0A      - tags                              = {} -> null%0A        # (17 unchanged attributes hidden)%0A%0A      - blob_properties {%0A          - change_feed_enabled           = false -> null%0A          - change_feed_retention_in_days = 0 -> null%0A          - last_access_time_enabled      = false -> null%0A          - versioning_enabled            = false -> null%0A        }%0A%0A      ~ network_rules {%0A          ~ bypass                     = [%0A              - "AzureServices",%0A            ] -> (known after apply)%0A          ~ ip_rules                   = [] -> (known after apply)%0A          ~ virtual_network_subnet_ids = [] -> (known after apply)%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      - queue_properties {%0A          - hour_metrics {%0A              - enabled               = true -> null%0A              - include_apis          = true -> null%0A              - retention_policy_days = 7 -> null%0A              - version               = "1.0" -> null%0A            }%0A          - logging {%0A              - delete                = false -> null%0A              - read                  = false -> null%0A              - retention_policy_days = 0 -> null%0A              - version               = "1.0" -> null%0A              - write                 = false -> null%0A            }%0A          - minute_metrics {%0A              - enabled               = false -> null%0A              - include_apis          = false -> null%0A              - retention_policy_days = 0 -> null%0A              - version               = "1.0" -> null%0A            }%0A        }%0A%0A      - share_properties {%0A          - retention_policy {%0A              - days = 7 -> null%0A            }%0A        }%0A    }%0A%0APlan: 4 to add, 1 to change, 2 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```